Revit 2026 API

# FilteredElementCollector(Document, ICollectionElementId) Constructor

---

Initializes a new instance of the FilteredElementCollector class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub New (
	document As Document,
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
FilteredElementCollector(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
new :
        document : Document *
        elementIds : ICollection<ElementId> -> FilteredElementCollector
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Reference

FilteredElementCollector Class

FilteredElementCollector Overload

Autodesk.Revit.DB Namespace